# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'hugo'
brew 'jq'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'p7zip'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'speedtest-cli'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Other Media
brew 'youtube-dl' #Get YouTube videos

# Development
brew 'php'
brew 'php@7.3'
brew 'php@7.2'
brew 'python@3.8'
brew 'composer'
brew 'imagemagick'
brew 'mysql'
brew 'nginx'
brew 'n' # Node version manager
brew 'redis'
brew 'rbenv'
brew 'sqlite'
brew 'yarn'

# Apps
cask '1password'
cask 'alfred'
cask 'authy'
cask 'brave-browser'
cask 'caffeine'
cask 'coda'
cask 'discord'
cask 'docker'
cask 'expressvpn'
cask 'firefox'
cask 'github'

cask 'google-chrome'
cask 'google-chrome-canary'

cask 'insomnia'

cask 'mysqlworkbench'
cask 'osxfuse' #for use with pCloud Drive
cask 'opera'
cask 'postbox'
cask 'postman'
cask 'slack'
cask 'sublime-text'
cask 'tableplus'
cask 'the-unarchiver'
cask 'transmit'
cask 'vagrant'
cask 'visual-studio-code'
cask 'virtualbox' # Might need to allow access in Security settings
cask 'virtualbox-extension-pack'
cask 'vlc'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
# mas 'Keynote', id: 409183694
# mas 'Numbers', id: 409203825

